{
  "recipes": [
    {
      "id": "1",
      "title": "Classic Spaghetti Carbonara",
      "author": "Jeromy Chang",
      "description": "A traditional Italian pasta dish with eggs, cheese, pancetta, and black pepper.",
      "ingredients": [
        "8 ounces spaghetti",
        "2 large eggs",
        "1 cup grated Pecorino Romano cheese",
        "4 ounces pancetta or bacon, diced",
        "2 cloves garlic, minced",
        "Salt and black pepper to taste",
        "Chopped fresh parsley for garnish"
      ],
      "instructions": [
        "Cook spaghetti according to package instructions until al dente. Reserve 1/2 cup of pasta water, then drain the spaghetti.",
        "In a bowl, whisk together eggs, grated cheese, salt, and black pepper. Set aside.",
        "In a large skillet, cook diced pancetta over medium heat until crispy. Add minced garlic and cook until fragrant.",
        "Reduce heat to low. Add cooked spaghetti to the skillet with pancetta and garlic. Toss to combine.",
        "Remove skillet from heat. Quickly pour the egg and cheese mixture over the hot spaghetti, tossing continuously to coat the pasta. If the sauce is too thick, add reserved pasta water gradually until desired consistency is reached.",
        "Serve immediately, garnished with chopped parsley and additional grated cheese if desired."
      ],
      "image": "../images/recipes/spaghetti.png",
      "category": [
        "Lunch",
        "Dinner"
      ],
      "comments": [
        {
          "name": "User123",
          "comment": "This was absolutely delicious! My family loved it."
        },
        {
          "name": "CookingFanatic",
          "comment": "Great recipe! I added some extra garlic for more flavor."
        }
      ]
    },
    {
      "id": "2",
      "title": "Classic Chocolate Chip Cookies",
      "author": "Justin Chung",
      "description": "Soft and chewy chocolate chip cookies with a perfect balance of sweetness and richness.",
      "ingredients": [
        "2 1/4 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 cup unsalted butter, softened",
        "3/4 cup granulated sugar",
        "3/4 cup packed brown sugar",
        "1 teaspoon vanilla extract",
        "2 large eggs",
        "2 cups semisweet chocolate chips"
      ],
      "instructions": [
        "Preheat oven to 375째F (190째C). Line baking sheets with parchment paper.",
        "In a medium bowl, whisk together flour, baking soda, and salt. Set aside.",
        "In a large bowl, cream together softened butter, granulated sugar, brown sugar, and vanilla extract until light and fluffy.",
        "Beat in eggs, one at a time, until well combined.",
        "Gradually add the flour mixture to the wet ingredients, mixing until just combined.",
        "Stir in chocolate chips until evenly distributed throughout the cookie dough.",
        "Drop tablespoon-sized balls of dough onto the prepared baking sheets, spacing them about 2 inches apart.",
        "Bake in preheated oven for 9 to 11 minutes, or until the edges are golden brown.",
        "Allow cookies to cool on baking sheets for 5 minutes before transferring to wire racks to cool completely."
      ],
      "image": "../images/recipes/cookie.png",
      "category": [
        "Dessert"
      ],
      "comments": [
        {
          "name": "BakingQueen",
          "comment": "These cookies turned out perfectly! Just the right amount of chewiness."
        },
        {
          "name": "SweetTooth",
          "comment": "My favorite chocolate chip cookie recipe! They disappear quickly every time I make them."
        }
      ]
    },
    {
      "id": "3",
      "title": "Chicken Parmesan",
      "author": "Aster Li",
      "description": "Tender chicken breasts coated in breadcrumbs, topped with marinara sauce and melted cheese.",
      "ingredients": [
        "4 boneless, skinless chicken breasts",
        "1 cup all-purpose flour",
        "2 large eggs, beaten",
        "1 cup Italian breadcrumbs",
        "1/2 cup grated Parmesan cheese",
        "1 cup marinara sauce",
        "1 cup shredded mozzarella cheese",
        "2 tablespoons olive oil",
        "Salt and black pepper to taste",
        "Chopped fresh basil for garnish"
      ],
      "instructions": [
        "Preheat oven to 375째F (190째C).",
        "Place each chicken breast between two sheets of plastic wrap. Pound with a meat mallet or rolling pin until about 1/2 inch thick.",
        "Season both sides of chicken breasts with salt and black pepper.",
        "Set up three shallow bowls: one with flour, one with beaten eggs, and one with a mixture of breadcrumbs and grated Parmesan cheese.",
        "Dredge each chicken breast in flour, then dip into beaten eggs, and coat with breadcrumb mixture, pressing gently to adhere.",
        "In a large skillet, heat olive oil over medium-high heat. Cook breaded chicken breasts for 3-4 minutes per side, or until golden brown and cooked through.",
        "Transfer cooked chicken breasts to a baking dish. Top each breast with marinara sauce and shredded mozzarella cheese.",
        "Bake in preheated oven for 15-20 minutes, or until the cheese is melted and bubbly.",
        "Garnish with chopped fresh basil before serving."
      ],
      "image": "../images/recipes/parmesan.png",
      "category": [
        "Dinner"
      ],
      "comments": [
        {
          "name": "Foodie123",
          "comment": "One of my go-to recipes for dinner parties! Always a crowd-pleaser."
        },
        {
          "name": "CookingNovice",
          "comment": "I was nervous to try making chicken parmesan, but this recipe was easy to follow and turned out delicious!"
        }
      ]
    },
    {
      "id": "4",
      "title": "Vegetable Stir-Fry",
      "author": "Sara Lee",
      "description": "A quick and healthy stir-fry packed with colorful vegetables and savory flavors.",
      "ingredients": [
        "2 cups broccoli florets",
        "1 red bell pepper, thinly sliced",
        "1 yellow bell pepper, thinly sliced",
        "1 carrot, julienned",
        "1 cup snap peas",
        "1 cup sliced mushrooms",
        "3 cloves garlic, minced",
        "1 tablespoon ginger, minced",
        "1/4 cup soy sauce",
        "2 tablespoons oyster sauce",
        "1 tablespoon sesame oil",
        "2 tablespoons vegetable oil",
        "Salt and black pepper to taste",
        "Cooked rice for serving",
        "Sesame seeds and chopped green onions for garnish"
      ],
      "instructions": [
        "In a small bowl, mix together soy sauce, oyster sauce, and sesame oil. Set aside.",
        "Heat vegetable oil in a large skillet or wok over high heat.",
        "Add minced garlic and ginger to the skillet and stir-fry for 30 seconds.",
        "Add broccoli, bell peppers, carrot, snap peas, and mushrooms to the skillet. Stir-fry for 4-5 minutes, or until vegetables are tender-crisp.",
        "Pour the sauce mixture over the vegetables in the skillet. Toss to coat evenly.",
        "Season with salt and black pepper to taste.",
        "Serve the stir-fried vegetables over cooked rice, garnished with sesame seeds and chopped green onions."
      ],
      "image": "../images/recipes/stir_fry.png",
      "category": [
        "Lunch",
        "Dinner"
      ],
      "comments": [
        {
          "name": "VeggieLover",
          "comment": "Delicious and colorful! I love how versatile this recipe is."
        },
        {
          "name": "HealthyEater",
          "comment": "Such a great way to get in a variety of veggies! Definitely making this again."
        }
      ]
    },
    {
      "id": "5",
      "title": "Creamy Tomato Basil Soup",
      "author": "Michaela Smith",
      "description": "A comforting and creamy tomato soup infused with the flavors of fresh basil.",
      "ingredients": [
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "3 cloves garlic, minced",
        "2 (28-ounce) cans whole peeled tomatoes",
        "2 cups vegetable broth",
        "1/2 cup heavy cream",
        "1/4 cup chopped fresh basil",
        "Salt and black pepper to taste",
        "Grated Parmesan cheese for garnish",
        "Croutons for serving"
      ],
      "instructions": [
        "In a large pot, heat olive oil over medium heat.",
        "Add chopped onion and garlic to the pot. Cook until softened and fragrant, about 5 minutes.",
        "Add whole peeled tomatoes (with juices) to the pot. Use a spoon to break up the tomatoes into smaller pieces.",
        "Pour in vegetable broth and bring the mixture to a simmer. Let it cook for 15-20 minutes, stirring occasionally.",
        "Using an immersion blender, blend the soup until smooth. Alternatively, transfer the soup in batches to a blender and blend until smooth, then return it to the pot.",
        "Stir in heavy cream and chopped fresh basil. Season with salt and black pepper to taste.",
        "Simmer the soup for an additional 5 minutes to allow the flavors to meld together.",
        "Serve the creamy tomato basil soup hot, garnished with grated Parmesan cheese and accompanied by croutons."
      ],
      "image": "../images/recipes/tomato_soup.png",
      "category": [
        "Lunch",
        "Dinner"
      ],
      "comments": [
        {
          "name": "SoupLover",
          "comment": "Absolutely delicious! The basil adds such a nice freshness to the soup."
        },
        {
          "name": "ComfortFoodFan",
          "comment": "Perfect for a cozy night in. Creamy and flavorful!"
        }
      ]
    }
  ]
}
